## ‚è≥ Chapter 04: Date and Time Analysis in SQL

### üìÖ Date/Time Types

SQL databases (especially PostgreSQL) handle two main temporal data types:

* **`DATE`** ‚Äì format: `YYYY-MM-DD`
  Example: `2018-12-30`

* **`TIMESTAMP`** ‚Äì format: `YYYY-MM-DD HH:MM:SS`
  Example: `2018-12-30 13:10:04.3`

### ‚è±Ô∏è Intervals

Intervals represent durations. They can include combinations of days, hours, minutes, and seconds:

Examples:

```
6 days 01:48:08
00:51:03
1 day 21:57:47
07:48:46
406 days 00:31:56
```

### üóìÔ∏è Date/Time Format Examples

SQL can parse and format many human-readable date formats. Some examples:

```
01/10/18 1:00
10/01/18 01:00:00
01/10/2018 1pm
January 10th, 2018 1pm
10 Jan 2018 1:00
01/10/18 13:00:00
```

### üß≠ ISO 8601 & Timezones

* **ISO 8601 Format:**
  `YYYY-MM-DD HH:MM:SS`
  Example: `2018-01-05 09:35:15`

* **Timestamps with Timezones:**
  Format: `YYYY-MM-DD HH:MM:SS+HH`
  Example: `2004-10-19 10:23:54+02`

### üîç Date Comparisons and `now()`

You can compare dates using `=`, `>`, `<`, etc.

```sql
SELECT '2018-01-01' > '2017-12-31';
-- Returns: true
```

```sql
SELECT now() > '2017-12-31';
```

### ‚ûñ Date Subtraction

Subtracting dates returns an interval.

```sql
SELECT now() - '2018-01-01';
-- Example: 343 days 21:26:32.710898
```

```sql
SELECT now() - '2015-01-01';
-- Example: 1439 days 21:32:22.616076
```

### ‚ûï Date Addition

```sql
SELECT '2010-01-01'::date + 1;
-- 2010-01-02
```

```sql
SELECT '2018-12-10'::date + '1 year'::interval;
-- 2019-12-10 00:00:00
```

```sql
SELECT '2018-12-10'::date + '1 year 2 days 3 minutes'::interval;
-- 2019-12-12 00:03:00
```

## üìä Date/Time Components & Aggregation

### üß© Common Fields

* `century`, `decade`, `year`, `month`, `day`
* `hour`, `minute`, `second`
* `week`, `dow` (day of week)

Use PostgreSQL's [`date_part`](https://www.postgresql.org/docs/current/functions-datetime.html) or `EXTRACT`.

```sql
SELECT date_part('month', now()), EXTRACT(MONTH FROM now());
```

**Result:**

<table style="text-align: left">
  <tr><th>date_part</th><th>date_part</th></tr>
  <tr><td>1</td><td>1</td></tr>
</table>

### üì¶ Summarize by Field

```sql
SELECT *  
  FROM sales 
 WHERE date >= '2010-01-01'  
   AND date < '2017-01-01';
```

**Sales Data:**

<table style="text-align: left">
  <tr><th>date</th><th>amt</th></tr>
  <tr><td>2010-01-05</td><td>32</td></tr>
  <tr><td>2010-03-04</td><td>10</td></tr>
  <tr><td>2010-07-29</td><td>7</td></tr>
  <tr><td>2016-12-20</td><td>46</td></tr>
  <tr><td>2015-11-01</td><td>30</td></tr>
  <tr><td>2014-07-10</td><td>35</td></tr>
  <tr><td>2013-09-09</td><td>15</td></tr>
  <tr><td>2011-04-22</td><td>9</td></tr>
</table>

```sql
SELECT date_part('month', date) AS month, sum(amt)
FROM sales
GROUP BY month
ORDER BY month;
```

**Aggregated by Month:**

<table style="text-align: left">
  <tr><th>month</th><th>sum</th></tr>
  <tr><td>1</td><td>432</td></tr>
  <tr><td>2</td><td>847</td></tr>
  <tr><td>3</td><td>1987</td></tr>
  <tr><td>4</td><td>3899</td></tr>
  <tr><td>5</td><td>974</td></tr>
  <tr><td>6</td><td>397</td>
</table>
  
## ü™ì Truncating Dates

Truncating keeps larger units (like the beginning of a month):

```sql
SELECT date_trunc('month', now());
-- 2018-12-01 00:00:00
```

```sql
SELECT date_trunc('month', date) AS month, sum(amt)
FROM sales
GROUP BY month
ORDER BY month;
```

**Monthly Sales:**

<table style="text-align: left">
  <tr><th>month</th><th>sum</th></tr>
  <tr><td>2017-06-01 00:00:00</td><td>594</td></tr>
  <tr><td>2017-07-01 00:00:00</td><td>3824</td></tr>
  <tr><td>2017-08-01 00:00:00</td><td>482</td></tr>
  <tr><td>2017-09-01 00:00:00</td><td>1384</td></tr>
  <tr><td>2017-10-01 00:00:00</td><td>3058</td></tr>
  <tr><td>2017-11-01 00:00:00</td><td>259</td></tr>
  <tr><td>2017-12-01 00:00:00</td><td>874</td></tr>
  <tr><td>2018-01-01 00:00:00</td><td>1225</td></tr>
</table>

## üìà Aggregating with Date/Time Series

### üîÅ Generating Series

The `generate_series()` function lets you create time intervals on the fly‚Äîno crystal ball needed.

```sql
SELECT generate_series('2018-01-01', '2018-01-15', '2 days'::interval);
```

**Result:**

<table style="text-align: left">
  <tr><th>generate_series</th></tr>
  <tr><td>2018-01-01 00:00:00</td></tr>
  <tr><td>2018-01-03 00:00:00</td></tr>
  <tr><td>2018-01-05 00:00:00</td></tr>
  <tr><td>2018-01-07 00:00:00</td></tr>
  <tr><td>2018-01-09 00:00:00</td></tr>
  <tr><td>2018-01-11 00:00:00</td></tr>
  <tr><td>2018-01-13 00:00:00</td></tr>
  <tr><td>2018-01-15 00:00:00</td></tr>
</table>

```sql
SELECT generate_series('2018-01-01', '2018-01-02', '5 hours'::interval);
```

**Result:**

<table style="text-align: left">
  <tr><th>generate_series</th></tr>
  <tr><td>2018-01-01 00:00:00</td></tr>
  <tr><td>2018-01-01 05:00:00</td></tr>
  <tr><td>2018-01-01 10:00:00</td></tr>
  <tr><td>2018-01-01 15:00:00</td></tr>
  <tr><td>2018-01-01 20:00:00</td></tr>
</table>

```sql
SELECT generate_series('2018-01-31', '2018-12-31', '1 month'::interval);
```

**Result:**

<table style="text-align: left">
  <tr><th>generate_series</th></tr>
  <tr><td>2018-01-31 00:00:00</td></tr>
  <tr><td>2018-02-28 00:00:00</td></tr>
  <tr><td>2018-03-28 00:00:00</td></tr>
  <tr><td>2018-04-28 00:00:00</td></tr>
  <tr><td>2018-05-28 00:00:00</td></tr>
  <tr><td>2018-06-28 00:00:00</td></tr>
  <tr><td>2018-07-28 00:00:00</td></tr>
  <tr><td>2018-08-28 00:00:00</td></tr>
  <tr><td>2018-09-28 00:00:00</td></tr>
  <tr><td>2018-10-28 00:00:00</td></tr>
  <tr><td>2018-11-28 00:00:00</td></tr>
  <tr><td>2018-12-28 00:00:00</td></tr>
</table>

```sql
SELECT generate_series('2018-02-01', '2019-01-01', '1 month'::interval) - '1 day'::interval;
```

**End of Month Results:**

<table style="text-align: left">
  <tr><th>generate_series</th></tr>
  <tr><td>2018-01-31 00:00:00</td></tr>
  <tr><td>2018-02-28 00:00:00</td></tr>
  <tr><td>2018-03-31 00:00:00</td></tr>
  <tr><td>2018-04-30 00:00:00</td></tr>
  <tr><td>2018-05-31 00:00:00</td></tr>
  <tr><td>2018-06-30 00:00:00</td></tr>
  <tr><td>2018-07-31 00:00:00</td></tr>
  <tr><td>2018-08-31 00:00:00</td></tr>
  <tr><td>2018-09-30 00:00:00</td></tr>
  <tr><td>2018-10-31 00:00:00</td></tr>
  <tr><td>2018-11-30 00:00:00</td></tr>
  <tr><td>2018-12-31 00:00:00</td></tr>
</table>

### üßÆ Aggregation with Truncation

```sql
SELECT date_trunc('hour', date) AS hour, count(*)
FROM sales
GROUP BY hour
ORDER BY hour;
```

**Hourly Aggregation:**

<table style="text-align: left">
  <tr><th>hour</th><th>count</th></tr>
  <tr><td>2018-04-23 09:00:00</td><td>3</td></tr>
  <tr><td>2018-04-23 10:00:00</td><td>2</td></tr>
  <tr><td>2018-04-23 12:00:00</td><td>3</td></tr>
  <tr><td>2018-04-23 13:00:00</td><td>2</td></tr>
</table>

### üîó Aggregation with a Generated Series (Complete Hourly Coverage)

```sql
WITH hour_series AS (
  SELECT generate_series('2018-04-23 09:00:00', '2018-04-23 14:00:00', '1 hour'::interval) AS hours
)
SELECT hours, count(date)
FROM hour_series
LEFT JOIN sales ON hours = date_trunc('hour', date)
GROUP BY hours
ORDER BY hours;
```

**Result:**

<table style="text-align: left">
  <tr><th>hours</th><th>count</th></tr>
  <tr><td>2018-04-23 09:00:00</td><td>3</td></tr>
  <tr><td>2018-04-23 10:00:00</td><td>2</td></tr>
  <tr><td>2018-04-23 11:00:00</td><td>0</td></tr>
  <tr><td>2018-04-23 12:00:00</td><td>3</td></tr>
  <tr><td>2018-04-23 13:00:00</td><td>2</td></tr>
  <tr><td>2018-04-23 14:00:00</td><td>0</td></tr>
</table>

### üì¶ Aggregation with Bins (e.g., 3-hour groups)

```sql
WITH bins AS (
  SELECT generate_series('2018-04-23 09:00:00', '2018-04-23 15:00:00', '3 hours'::interval) AS lower,
         generate_series('2018-04-23 12:00:00', '2018-04-23 18:00:00', '3 hours'::interval) AS upper
)
SELECT lower, upper, count(date)
FROM bins
LEFT JOIN sales ON date >= lower AND date < upper
GROUP BY lower, upper
ORDER BY lower;
```

**Bin Results:**

<table style="text-align: left">
  <tr><th>lower</th><th>upper</th><th>count</th></tr>
  <tr><td>2018-04-23 09:00:00</td><td>2018-04-23 12:00:00</td><td>5</td></tr>
  <tr><td>2018-04-23 12:00:00</td><td>2018-04-23 15:00:00</td><td>5</td></tr>
  <tr><td>2018-04-23 15:00:00</td><td>2018-04-23 18:00:00</td><td>0</td></tr>
</table>

Let‚Äôs roll straight into the grand finale of Chapter 4‚Äîthe part where we measure time gaps, analyze temporal differences, and use SQL to expose the heartbeat of a dataset. This is where your queries go full time-travel detective. üïµÔ∏è‚Äç‚ôÄÔ∏è‚è≥

## ‚åõ Time Between Events

### üîÑ Viewing Event Chronology

```sql
SELECT *  
  FROM sales 
 ORDER BY date;
```

**Sales Data Ordered by Date:**

<table style="text-align: left">
  <tr><th>date</th><th>amount</th></tr>
  <tr><td>2018-04-23 09:07:33</td><td>31</td></tr>
  <tr><td>2018-04-23 09:13:14</td><td>12</td></tr>
  <tr><td>2018-04-23 09:35:16</td><td>18</td></tr>
  <tr><td>2018-04-23 10:12:35</td><td>13</td></tr>
  <tr><td>2018-04-23 10:31:40</td><td>5</td></tr>
  <tr><td>2018-04-23 12:05:44</td><td>23</td></tr>
  <tr><td>2018-04-23 12:17:43</td><td>19</td></tr>
  <tr><td>2018-04-23 12:57:49</td><td>32</td></tr>
  <tr><td>2018-04-23 13:21:30</td><td>6</td></tr>
  <tr><td>2018-04-23 13:57:53</td><td>41</td></tr>
</table>

### üîÅ `LEAD()` and `LAG()` Basics

```sql
SELECT date, 
       lag(date) OVER (ORDER BY date), 
       lead(date) OVER (ORDER BY date) 
  FROM sales;
```

**Lead/Lag Results:**

<table style="text-align: left">
  <tr><th>date</th><th>lag</th><th>lead</th></tr>
  <tr><td>2018-04-23 09:07:33</td><td></td><td>2018-04-23 09:13:14</td></tr>
  <tr><td>2018-04-23 09:13:14</td><td>2018-04-23 09:07:33</td><td>2018-04-23 09:35:16</td></tr>
  <tr><td>2018-04-23 09:35:16</td><td>2018-04-23 09:13:14</td><td>2018-04-23 10:12:35</td></tr>
  <tr><td>2018-04-23 10:12:35</td><td>2018-04-23 09:35:16</td><td>2018-04-23 10:31:40</td></tr>
  <tr><td>2018-04-23 10:31:40</td><td>2018-04-23 10:12:35</td><td>2018-04-23 12:05:44</td></tr>
  <tr><td>2018-04-23 12:05:44</td><td>2018-04-23 10:31:40</td><td>2018-04-23 12:17:43</td></tr>
  <tr><td>2018-04-23 12:17:43</td><td>2018-04-23 12:05:44</td><td>2018-04-23 12:57:49</td></tr>
  <tr><td>2018-04-23 12:57:49</td><td>2018-04-23 12:17:43</td><td>2018-04-23 13:21:30</td></tr>
  <tr><td>2018-04-23 13:21:30</td><td>2018-04-23 12:57:49</td><td>2018-04-23 13:57:53</td></tr>
  <tr><td>2018-04-23 13:57:53</td><td>2018-04-23 13:21:30</td><td></td></tr>
</table>

### ‚è≥ Calculating Gaps Between Events

```sql
SELECT date, 
       date - lag(date) OVER (ORDER BY date) AS gap 
  FROM sales;
```

**Time Gaps Between Rows:**

<table style="text-align: left">
  <tr><th>date</th><th>gap</th></tr>
  <tr><td>2018-04-23 09:07:33</td><td></td></tr>
  <tr><td>2018-04-23 09:13:14</td><td>00:05:41</td></tr>
  <tr><td>2018-04-23 09:35:16</td><td>00:22:02</td></tr>
  <tr><td>2018-04-23 10:12:35</td><td>00:37:19</td></tr>
  <tr><td>2018-04-23 10:31:40</td><td>00:19:05</td></tr>
  <tr><td>2018-04-23 12:05:44</td><td>01:34:04</td></tr>
  <tr><td>2018-04-23 12:17:43</td><td>00:11:59</td></tr>
  <tr><td>2018-04-23 12:57:49</td><td>00:40:06</td></tr>
  <tr><td>2018-04-23 13:21:30</td><td>00:23:41</td></tr>
  <tr><td>2018-04-23 13:57:53</td><td>00:36:23</td></tr>
</table>

### üìä Average Time Between Events

```sql
SELECT avg(gap)  
FROM (
  SELECT date - lag(date) OVER (ORDER BY date) AS gap 
  FROM sales
) AS gaps;
```

**Result:**

<table style="text-align: left">
  <tr><th>avg</th></tr>
  <tr><td>00:32:15.555556</td></tr>
</table>

### üìâ Change in Time Series (Œî Value)

Let‚Äôs say you want to see how the "amount" values are changing:

```sql
SELECT date,  
       amount,  
       lag(amount) OVER (ORDER BY date), 
       amount - lag(amount) OVER (ORDER BY date) AS change 
  FROM sales;
```

**Changes in Amount:**

<table style="text-align: left">
  <tr><th>date</th><th>amount</th><th>lag</th><th>change</th></tr>
  <tr><td>2018-04-23 09:07:33</td><td>31</td><td></td><td></td></tr>
  <tr><td>2018-04-23 09:13:14</td><td>12</td><td>31</td><td>-19</td></tr>
  <tr><td>2018-04-23 09:35:16</td><td>18</td><td>12</td><td>6</td></tr>
  <tr><td>2018-04-23 10:12:35</td><td>13</td><td>18</td><td>-5</td></tr>
  <tr><td>2018-04-23 10:31:40</td><td>5</td><td>13</td><td>-8</td></tr>
  <tr><td>2018-04-23 12:05:44</td><td>23</td><td>5</td><td>18</td></tr>
  <tr><td>2018-04-23 12:17:43</td><td>19</td><td>23</td><td>-4</td></tr>
  <tr><td>2018-04-23 12:57:49</td><td>32</td><td>19</td><td>13</td></tr>
  <tr><td>2018-04-23 13:21:30</td><td>6</td><td>32</td><td>-26</td></tr>
  <tr><td>2018-04-23 13:57:53</td><td>41</td><td>6</td><td>35</td></tr>
</table>

## üéÅ Wrap-up: Key Takeaways

* Use **`date_part`** or **`EXTRACT`** to slice out date parts.
* Use **`date_trunc`** to bucket time into hours/days/months.
* Use **`generate_series()`** to fill gaps and build time intervals.
* Use **`lag()` and `lead()`** to access surrounding rows.
* Use interval arithmetic (`-`, `+`) for time differences.
* Always question your gaps‚Äîmissing data = hidden stories.